zhuyu9/demo-xibao/esp32/XBBtn/XBBtn.ino
#include <WiFi.h>
#include <driver/i2s.h>
#include <time.h>

#include "M5Atom.h"
#include <ArduinoWebsockets.h>
#include <ArduinoJson.h>
#include <string.h>
#include <string>

const char *WifiSSID = "Z-HOME";
const char *WifiPWD  = "perfect56";

// demo-xibao 后端配置。使用完整 URL 以兼容 ws/wss、默认端口、SNI 和反代路径前缀。
// #define DEVICE_WS_URL "wss://bizbiji.com/xibao/api/device/ws"
// 本地调试可切回：
#define DEVICE_WS_URL "ws://192.168.3.214:8000/api/device/ws"

// WSS 优先使用 CA 校验；现场网络/NTP/证书链异常时回退到 setInsecure，保证连接可用。
#define DEVICE_WS_TLS_USE_CA 1
#define DEVICE_WS_TLS_FALLBACK_INSECURE 1

// bizbiji.com 当前使用 Let's Encrypt 证书链，根证书为 ISRG Root X1。
static const char DEVICE_WS_CA_CERT[] PROGMEM = R"EOF(
-----BEGIN CERTIFICATE-----
MIIFazCCA1OgAwIBAgIRAIIQz7DSQONZRGPgu2OCiwAwDQYJKoZIhvcNAQELBQAw
TzELMAkGA1UEBhMCVVMxKTAnBgNVBAoTIEludGVybmV0IFNlY3VyaXR5IFJlc2Vh
cmNoIEdyb3VwMRUwEwYDVQQDEwxJU1JHIFJvb3QgWDEwHhcNMTUwNjA0MTEwNDM4
WhcNMzUwNjA0MTEwNDM4WjBPMQswCQYDVQQGEwJVUzEpMCcGA1UEChMgSW50ZXJu
ZXQgU2VjdXJpdHkgUmVzZWFyY2ggR3JvdXAxFTATBgNVBAMTDElTUkcgUm9vdCBY
MTCCAiIwDQYJKoZIhvcNAQEBBQADggIPADCCAgoCggIBAK3oJHP0FDfzm54rVygc
h77ct984kIxuPOZXoHj3dcKi/vVqbvYATyjb3miGbESTtrFj/RQSa78f0uoxmyF+
0TM8ukj13Xnfs7j/EvEhmkvBioZxaUpmZmyPfjxwv60pIgbz5MDmgK7iS4+3mX6U
A5/TR5d8mUgjU+g4rk8Kb4Mu0UlXjIB0ttov0DiNewNwIRt18jA8+o+u3dpjq+sW
T8KOEUt+zwvo/7V3LvSye0rgTBIlDHCNAymg4VMk7BPZ7hm/ELNKjD+Jo2FR3qyH
B5T0Y3HsLuJvW5iB4YlcNHlsdu87kGJ55tukmi8mxdAQ4Q7e2RCOFvu396j3x+UC
B5iPNgiV5+I3lg02dZ77DnKxHZu8A/lJBdiB3QW0KtZB6awBdpUKD9jf1b0SHzUv
KBds0pjBqAlkd25HN7rOrFleaJ1/ctaJxQZBKT5ZPt0m9STJEadao0xAH0ahmbWn
OlFuhjuefXKnEgV4We0+UXgVCwOPjdAvBbI+e0ocS3MFEvzG6uBQE3xDk3SzynTn
jh8BCNAw1FtxNrQHusEwMFxIt4I7mKZ9YIqioymCzLq9gwQbooMDQaHWBfEbwrbw
qHyGO0aoSCqI3Haadr8faqU9GY/rOPNk3sgrDQoo//fb4hVC1CLQJ13hef4Y53CI
rU7m2Ys6xt0nUW7/vGT1M0NPAgMBAAGjQjBAMA4GA1UdDwEB/wQEAwIBBjAPBgNV
HRMBAf8EBTADAQH/MB0GA1UdDgQWBBR5tFnme7bl5AFzgAiIyBpY9umbbjANBgkq
hkiG9w0BAQsFAAOCAgEAVR9YqbyyqFDQDLHYGmkgJykIrGF1XIpu+ILlaS/V9lZL
ubhzEFnTIZd+50xx+7LSYK05qAvqFyFWhfFQDlnrzuBZ6brJFe+GnY+EgPbk6ZGQ
3BebYhtF8GaV0nxvwuo77x/Py9auJ/GpsMiu/X1+mvoiBOv/2X/qkSsisRcOj/KK
NFtY2PwByVS5uCbMiogziUwthDyC3+6WVwW6LLv3xLfHTjuCvjHIInNzktHCgKQ5
ORAzI4JMPJ+GslWYHb4phowim57iaztXOoJwTdwJx4nLCgdNbOhdjsnvzqvHu7Ur
TkXWStAmzOVyyghqpZXjFaH3pO3JLF+l+/+sKAIuvtd7u+Nxe5AW0wdeRlN8NwdC
jNPElpzVmbUq4JUagEiuTDkHzsxHpFKVK7q4+63SM1N95R1NbdWhscdCb+ZAJzVc
oyi3B43njTOQ5yOf+1CceWxG1bQVs5ZufpsMljq4Ui0/1lvh+wjChP4kqKOJ2qxq
4RgqsahDYVvTH9w7jXbyLeiNdd8XM2w9U/t7y0Ff/9yi0GE44Za4rF2LN9d11TPA
mRGunUHBcnWEvgJBQl9nJEiU0Zsnvgc/ubhPgXRR4Xq37Z0j4r7g1SgEEzwxA57d
emyPxgcYxn/eR44/KJ4EBs+lVDR3veyJm+kXQ99b21/+jh5Xos1AnX5iItreGCc=
-----END CERTIFICATE-----
)EOF";

#define CONFIG_I2S_BCK_PIN     19
#define CONFIG_I2S_LRCK_PIN    33
#define CONFIG_I2S_DATA_PIN    22
#define CONFIG_I2S_DATA_IN_PIN 23

#define SPEAK_I2S_NUMBER I2S_NUM_0

#define MODE_MIC 0
#define MODE_SPK 1
#define I2S_DMA_BUF_COUNT 6
#define I2S_DMA_BUF_LEN 60

enum DeviceState {
    STATE_IDLE,
    STATE_READY,
    STATE_RECORDING,
    STATE_WAIT_RESULT,
    STATE_PLAYBACK,
    STATE_ERROR,
};

websockets::WebsocketsClient ws_client;
volatile bool isWebSocketConnected = false;
DeviceState g_state = STATE_IDLE;

bool g_wsIntentionalClose = false;
unsigned long g_lastWsActivityAtMs = 0;
unsigned long g_lastWsConnectAttemptAtMs = 0;
static const unsigned long WS_IDLE_DISCONNECT_MS = 15000;
static const unsigned long WS_RECONNECT_BACKOFF_MS = 1500;
// Keep the WSS connection warm while READY so pressing the button can enter
// recording immediately instead of waiting for DNS/TCP/TLS/WebSocket handshake.
static const bool WS_KEEP_READY_CONNECTION = true;

#define I2S_READ_CHUNK_SIZE 1024
static uint8_t i2s_read_buffer[I2S_READ_CHUNK_SIZE];
int g_currentI2SMode = MODE_SPK;
bool g_i2sInstalled = false;
int g_speakerSampleRate = 24000;

// 4Ω 2W 喇叭比 8Ω 更灵敏，输出需要适当衰减防止失真。
// 范围 0~255，值越小音量越低。建议从 180 开始试。
static const uint8_t SPEAKER_VOLUME = 60;

// Microphone capture tuning (long-term quality baseline)
// 1) Gain boosts low-level input from PDM mic.
// 2) Soft limiter prevents hard clipping after gain.
// 3) Noise gate reduces background hiss during silence.
// Increase front-end gain because raw PDM input level is consistently low in real runs.
static const float MIC_CAPTURE_GAIN = 4.8f;
static const int16_t MIC_SOFT_LIMIT = 28000;
// Keep this low: hard gate at high threshold will chop syllables and hurt ASR.
static const int16_t MIC_NOISE_GATE = 12;
// Instead of muting to zero, attenuate low-level region to preserve continuity.
static const uint8_t MIC_GATE_ATTENUATION_SHIFT = 1;  // /2
static const unsigned long MIC_STATS_PRINT_INTERVAL_MS = 1000;
static const uint32_t MIC_FADE_IN_SAMPLES = 640;      // 40 ms @ 16 kHz
static const uint32_t MIC_FADE_OUT_SAMPLES = 320;     // 20 ms @ 16 kHz
static const size_t MIC_PRIME_DROP_BYTES = 1280;      // 40 ms @ 16 kHz, s16 mono
static const float MIC_HPF_ALPHA = 0.985f;            // remove low-frequency plosive thump

struct MicCaptureStats {
    uint32_t sampleCount;
    uint32_t gateHitCount;
    uint32_t nearLimitCount;
    uint32_t hardClipCount;
    uint64_t inAbsSum;
    uint64_t outAbsSum;
    uint16_t inPeak;
    uint16_t outPeak;
};

MicCaptureStats g_micStats = {0};
unsigned long g_lastMicStatsPrintAtMs = 0;
uint32_t g_micSessionSampleIndex = 0;
size_t g_micPrimeDropBytesRemaining = 0;
float g_micHpfPrevIn = 0.0f;
float g_micHpfPrevOut = 0.0f;

#define SPEAKER_RING_BUFFER_SIZE 65536
#define SPEAKER_PLAY_CHUNK_SIZE 2048
#define SPEAKER_PREBUFFER_BYTES 8192
static uint8_t g_speakerRing[SPEAKER_RING_BUFFER_SIZE];
volatile size_t g_speakerHead = 0;
volatile size_t g_speakerTail = 0;
volatile bool g_ttsActive = false;
volatile size_t g_ttsBytesInCurrent = 0;
volatile bool g_playbackStarted = false;
volatile bool g_ttsPcmReady = true;
bool g_pcmCarryValid = false;
uint8_t g_pcmCarryByte = 0;

size_t speakerRingUsed() {
    if (g_speakerHead >= g_speakerTail) {
        return g_speakerHead - g_speakerTail;
    }
    return SPEAKER_RING_BUFFER_SIZE - (g_speakerTail - g_speakerHead);
}

size_t speakerRingFree() {
    // Keep 1 byte gap to distinguish full vs empty.
    return SPEAKER_RING_BUFFER_SIZE - speakerRingUsed() - 1;
}

void speakerRingReset() {
    g_speakerHead = 0;
    g_speakerTail = 0;
}

void enqueueSpeakerPcm(const uint8_t *data, size_t len) {
    if (len == 0) {
        return;
    }
    size_t freeBytes = speakerRingFree();
    if (len > freeBytes) {
        size_t drop = len - freeBytes;
        // 向上取整到 2 字节边界，保证 S16LE 对齐。
        // 若 drop 为奇数，tail 会偏移到奇数位置，导致后续所有采样高低字节颠倒，声音变成噪音。
        drop = (drop + 1) & ~((size_t)1);
        g_speakerTail = (g_speakerTail + drop) % SPEAKER_RING_BUFFER_SIZE;
    }
    for (size_t i = 0; i < len; ++i) {
        g_speakerRing[g_speakerHead] = data[i];
        g_speakerHead = (g_speakerHead + 1) % SPEAKER_RING_BUFFER_SIZE;
    }
    g_ttsBytesInCurrent += len;
}

void enqueueSpeakerPcmS16(const uint8_t *data, size_t len) {
    if (len == 0) {
        return;
    }
    if (g_pcmCarryValid) {
        uint8_t pair[2] = {g_pcmCarryByte, data[0]};
        enqueueSpeakerPcm(pair, 2);
        g_pcmCarryValid = false;
        data += 1;
        len -= 1;
    }
    size_t evenLen = len & ~((size_t)1);
    if (evenLen > 0) {
        enqueueSpeakerPcm(data, evenLen);
    }
    if ((len & 1) == 1) {
        g_pcmCarryByte = data[len - 1];
        g_pcmCarryValid = true;
    }
}

// Debug: print raw PCM amplitude before volume control
static unsigned long s_lastRawPrintAtMs = 0;
void debugPrintRawPcm(const uint8_t *data, size_t len) {
    if (len < 2) return;
    size_t samples = len / 2;
    int16_t maxRaw = 0;
    int32_t sumRaw = 0;
    for (size_t i = 0; i < samples; ++i) {
        int16_t s = (int16_t)((uint16_t)data[i * 2] | ((uint16_t)data[i * 2 + 1] << 8));
        int16_t absS = s >= 0 ? s : -s;
        if (absS > maxRaw) maxRaw = absS;
        sumRaw += absS;
    }
    unsigned long now = millis();
    if (now - s_lastRawPrintAtMs >= 2000) {
        float dbAtt = 20.0f * log10((float)SPEAKER_VOLUME / 255.0f);
        Serial.printf("[raw] raw_max=%d raw_avg=%.1f vol=%u out_max~=%d atten=%.1fdB\n",
                      maxRaw, (float)sumRaw / samples, SPEAKER_VOLUME,
                      (int)(maxRaw * (float)SPEAKER_VOLUME / 255.0f), dbAtt);
        s_lastRawPrintAtMs = now;
    }
}

bool InitI2SSpeakOrMic(int mode) {
    esp_err_t err = ESP_OK;

    if (g_i2sInstalled) {
        i2s_driver_uninstall(SPEAK_I2S_NUMBER);
        g_i2sInstalled = false;
    }
    i2s_config_t i2s_config = {
        .mode        = (i2s_mode_t)(I2S_MODE_MASTER),
        .sample_rate = (mode == MODE_MIC) ? 16000 : g_speakerSampleRate,
        .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
        .channel_format = I2S_CHANNEL_FMT_ALL_RIGHT,
#if ESP_IDF_VERSION > ESP_IDF_VERSION_VAL(4, 1, 0)
        .communication_format = I2S_COMM_FORMAT_STAND_I2S,
#else
        .communication_format = I2S_COMM_FORMAT_I2S,
#endif
        .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
        .dma_buf_count    = I2S_DMA_BUF_COUNT,
        .dma_buf_len      = I2S_DMA_BUF_LEN,
        .use_apll = false,
        .tx_desc_auto_clear = true,
    };

    if (mode == MODE_MIC) {
        i2s_config.mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX | I2S_MODE_PDM);
    } else {
        i2s_config.mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX);
    }

