zhuyu9/demo-xibao/esp32/XBBtn/XBBtn.ino
    err = i2s_driver_install(SPEAK_I2S_NUMBER, &i2s_config, 0, NULL);
    if (err != ESP_OK) {
        Serial.printf("i2s_driver_install error: %d\n", err);
        return false;
    }
    g_i2sInstalled = true;

    i2s_pin_config_t tx_pin_config;
#if (ESP_IDF_VERSION > ESP_IDF_VERSION_VAL(4, 3, 0))
    tx_pin_config.mck_io_num = I2S_PIN_NO_CHANGE;
#endif
    tx_pin_config.bck_io_num   = CONFIG_I2S_BCK_PIN;
    tx_pin_config.ws_io_num    = CONFIG_I2S_LRCK_PIN;
    tx_pin_config.data_out_num = CONFIG_I2S_DATA_PIN;
    tx_pin_config.data_in_num  = CONFIG_I2S_DATA_IN_PIN;

    err = i2s_set_pin(SPEAK_I2S_NUMBER, &tx_pin_config);
    if (err != ESP_OK) {
        Serial.printf("i2s_set_pin error: %d\n", err);
        return false;
    }

    int sampleRate = (mode == MODE_MIC) ? 16000 : g_speakerSampleRate;
    err = i2s_set_clk(SPEAK_I2S_NUMBER, sampleRate, I2S_BITS_PER_SAMPLE_16BIT, I2S_CHANNEL_MONO);
    if (err != ESP_OK) {
        Serial.printf("i2s_set_clk error: %d\n", err);
        return false;
    }

    if (mode == MODE_MIC) {
        i2s_zero_dma_buffer(SPEAK_I2S_NUMBER);
    }

    g_currentI2SMode = mode;
    return true;
}

void setState(DeviceState next) {
    g_state = next;
    switch (next) {
        case STATE_IDLE:
            M5.dis.drawpix(0, CRGB(0, 0, 64));
            break;
        case STATE_READY:
            M5.dis.drawpix(0, CRGB(0, 255, 0));
            break;
        case STATE_RECORDING:
            M5.dis.drawpix(0, CRGB(255, 255, 0));
            break;
        case STATE_WAIT_RESULT:
            M5.dis.drawpix(0, CRGB(0, 128, 255));
            break;
        case STATE_PLAYBACK:
            M5.dis.drawpix(0, CRGB(255, 0, 255));
            break;
        default:
            M5.dis.drawpix(0, CRGB(255, 0, 0));
            break;
    }
}

bool ensureI2SMode(int mode) {
    if (g_currentI2SMode == mode) {
        return true;
    }
    return InitI2SSpeakOrMic(mode);
}

bool isSecureDeviceWebSocketUrl() {
    return strncmp(DEVICE_WS_URL, "wss://", 6) == 0;
}

void syncTlsClockIfNeeded() {
    if (!isSecureDeviceWebSocketUrl()) {
        return;
    }

    configTime(0, 0, "ntp.aliyun.com", "ntp1.aliyun.com", "pool.ntp.org");
    Serial.print("[tls] sync clock");

    for (int i = 0; i < 25; ++i) {
        time_t now = time(nullptr);
        struct tm timeinfo;
        if (now > 1704067200 && gmtime_r(&now, &timeinfo) != nullptr) {
            Serial.printf(" ok %04d-%02d-%02dT%02d:%02d:%02dZ\n",
                          timeinfo.tm_year + 1900,
                          timeinfo.tm_mon + 1,
                          timeinfo.tm_mday,
                          timeinfo.tm_hour,
                          timeinfo.tm_min,
                          timeinfo.tm_sec);
            return;
        }
        Serial.print(".");
        delay(200);
    }

    Serial.println(" timeout, will rely on TLS fallback if needed");
}

bool connectWifi() {
    WiFi.mode(WIFI_STA);
    WiFi.setSleep(false);
    WiFi.begin(WifiSSID, WifiPWD);

    Serial.println("Connecting to WiFi...");
    setState(STATE_IDLE);

    unsigned long start = millis();
    while (WiFi.status() != WL_CONNECTED) {
        delay(500);
        Serial.print('.');
        if (millis() - start > 20000) {
            Serial.println("\nWiFi Connection Failed");
            setState(STATE_ERROR);
            return false;
        }
    }

    Serial.println("\nWiFi connected");
    Serial.print("IP: ");
    Serial.println(WiFi.localIP());
    syncTlsClockIfNeeded();
    return true;
}


void onWebsocketMessage(websockets::WebsocketsMessage message);
void onWebsocketEvent(websockets::WebsocketsEvent event, String data);
void resetMicCaptureStats();
void printMicCaptureStats(const char *tag);
void maybePrintMicCaptureStats();
void applyMicFadeOutTail(uint8_t *data, size_t len);
void markWsActivity();
bool isWsConnectionRequired(bool buttonPressed);
void closeDeviceWebSocketIfOpen(const char *reason);

void markWsActivity() {
    g_lastWsActivityAtMs = millis();
}

bool isWsConnectionRequired(bool buttonPressed) {
    if (WS_KEEP_READY_CONNECTION && g_state == STATE_READY) {
        return true;
    }
    if (buttonPressed && g_state == STATE_READY) {
        return true;
    }
    return g_state == STATE_RECORDING ||
           g_state == STATE_WAIT_RESULT ||
           g_state == STATE_PLAYBACK ||
           g_ttsActive;
}

void closeDeviceWebSocketIfOpen(const char *reason) {
    if (g_wsIntentionalClose) {
        return;
    }
    if (!isWebSocketConnected && !ws_client.available()) {
        return;
    }
    g_wsIntentionalClose = true;
    Serial.printf("[ws] close idle connection: %s\n", reason);
    ws_client.close();
    isWebSocketConnected = false;
}

bool connectDeviceWebSocket() {
    g_lastWsConnectAttemptAtMs = millis();
    ws_client.onMessage(onWebsocketMessage);
    ws_client.onEvent(onWebsocketEvent);

    Serial.printf("Connect %s\n", DEVICE_WS_URL);

    bool ok = false;
    if (isSecureDeviceWebSocketUrl()) {
#if DEVICE_WS_TLS_USE_CA
        Serial.println("[tls] using CA certificate validation");
        ws_client.setCACert(DEVICE_WS_CA_CERT);
        ok = ws_client.connect(DEVICE_WS_URL);
#if DEVICE_WS_TLS_FALLBACK_INSECURE
        if (!ok) {
            ws_client.close();
            delay(100);
            Serial.println("[tls] CA validation/connect failed, retrying with setInsecure()");
            ws_client.setInsecure();
            ok = ws_client.connect(DEVICE_WS_URL);
        }
#endif
#else
        Serial.println("[tls] using setInsecure()");
        ws_client.setInsecure();
        ok = ws_client.connect(DEVICE_WS_URL);
#endif
    } else {
        ok = ws_client.connect(DEVICE_WS_URL);
    }
    if (!ok) {
        isWebSocketConnected = false;
        Serial.println("[ws] connect failed");
        return false;
    }

    isWebSocketConnected = true;
    g_wsIntentionalClose = false;
    markWsActivity();
    return true;
}

void startVoiceSession() {
    if (!isWebSocketConnected || !ws_client.available()) {
        Serial.println("ws not connected");
        setState(STATE_ERROR);
        return;
    }

    if (!ensureI2SMode(MODE_MIC)) {
        setState(STATE_ERROR);
        return;
    }

    resetMicCaptureStats();
    Serial.printf("[mic] gain=%.2f gate=%d soft_limit=%d\n", MIC_CAPTURE_GAIN, MIC_NOISE_GATE, MIC_SOFT_LIMIT);
    Serial.println("voice session started");
    setState(STATE_RECORDING);
}

void finishVoiceSession() {
    if (!isWebSocketConnected || !ws_client.available()) {
        return;
    }

    ws_client.send("finish");
    markWsActivity();

