zhuyu9/demo-xibao/esp32/XBBtn/XBBtn.ino
void applyMicFadeOutTail(uint8_t *data, size_t len) {
    if (!data || len < 2) {
        return;
    }
    size_t samples = len / 2;
    size_t fadeSamples = (samples < MIC_FADE_OUT_SAMPLES) ? samples : MIC_FADE_OUT_SAMPLES;
    if (fadeSamples == 0) {
        return;
    }

    size_t fadeStart = samples - fadeSamples;
    for (size_t i = 0; i < fadeSamples; ++i) {
        size_t idx = fadeStart + i;
        int16_t s = (int16_t)((uint16_t)data[idx * 2] | ((uint16_t)data[idx * 2 + 1] << 8));
        uint32_t remain = (uint32_t)(fadeSamples - i);
        int32_t scaled = ((int32_t)s * (int32_t)remain) / (int32_t)fadeSamples;
        int16_t out = (int16_t)scaled;
        data[idx * 2] = (uint8_t)(out & 0xFF);
        data[idx * 2 + 1] = (uint8_t)((out >> 8) & 0xFF);
    }
}

void processSpeakerPlayback() {
    size_t used = speakerRingUsed();
    if (!g_playbackStarted) {
        if (used >= SPEAKER_PREBUFFER_BYTES || (!g_ttsActive && used > 0)) {
            g_playbackStarted = true;
        } else {
            return;
        }
    }

    if (used == 0) {
        if (!g_ttsActive && g_state == STATE_PLAYBACK) {
            setState(STATE_READY);
        }
        return;
    }

    if (!ensureI2SMode(MODE_SPK)) {
        setState(STATE_ERROR);
        return;
    }

    uint8_t chunk[SPEAKER_PLAY_CHUNK_SIZE];
    size_t take = used;
    if (take > sizeof(chunk)) {
        take = sizeof(chunk);
    }

    for (size_t i = 0; i < take; ++i) {
        chunk[i] = g_speakerRing[g_speakerTail];
        g_speakerTail = (g_speakerTail + 1) % SPEAKER_RING_BUFFER_SIZE;
    }
    writeSpeakerPcm(chunk, take);
}

void setup() {
    M5.begin(true, false, true);
    M5.dis.clear();
    Serial.begin(115200);

    delay(200);
    Serial.println("XBBtn Booting...");

    InitI2SSpeakOrMic(MODE_SPK);
    setState(STATE_IDLE);

    if (!connectWifi()) {
        return;
    }

    if (WS_KEEP_READY_CONNECTION) {
        connectDeviceWebSocket();
    }

    setState(STATE_READY);
}

void onWebsocketMessage(websockets::WebsocketsMessage message) {
    markWsActivity();
    if (message.isText()) {
        String text = message.c_str();
        Serial.printf("[ws] %s\n", text.c_str());

        StaticJsonDocument<512> doc;
        if (deserializeJson(doc, text)) {
            return;
        }

        String type = doc["type"].as<String>();
        if (type == "asr") {
            String asrText = doc["text"].as<String>();
            bool isFinal = doc["is_final"] | false;
            Serial.printf("[asr]%s %s\n", isFinal ? " [FINAL]" : "", asrText.c_str());
        } else if (type == "error") {
            Serial.printf("[ws] error: %s\n", doc["message"].as<String>().c_str());
            setState(STATE_ERROR);
        } else if (type == "tts.start") {
            g_ttsActive = true;
            g_ttsBytesInCurrent = 0;
            g_playbackStarted = false;
            g_pcmCarryValid = false;
            speakerRingReset();
            int sr = doc["sample_rate"] | 24000;
            if (sr < 8000 || sr > 48000) {
                sr = 24000;
            }
            g_speakerSampleRate = sr;
            String fmt = doc["format"].as<String>();
            int channels = doc["channels"] | 1;
            g_ttsPcmReady = (fmt == "pcm_s16le" && channels == 1);
            if (!g_ttsPcmReady) {
                Serial.printf("[tts] unsupported stream fmt=%s ch=%d\n", fmt.c_str(), channels);
            }
            Serial.printf("[tts] start sr=%d ch=%d fmt=%s voice=%s\n",
                          g_speakerSampleRate,
                          channels,
                          fmt.c_str(),
                          doc["voice"].as<String>().c_str());
            if (g_state != STATE_RECORDING) {
                setState(STATE_PLAYBACK);
            }
        } else if (type == "tts.end") {
            g_ttsActive = false;
            g_ttsPcmReady = true;
            g_pcmCarryValid = false;
            Serial.printf("[tts] end bytes=%u buffered=%u\n",
                          (unsigned int)g_ttsBytesInCurrent,
                          (unsigned int)speakerRingUsed());
            if (g_state != STATE_RECORDING && speakerRingUsed() == 0) {
                g_playbackStarted = false;
                setState(STATE_READY);
            }
        }
        return;
    }

    const std::string &raw = message.rawData();
    if (!raw.empty()) {
        if (g_state != STATE_RECORDING) {
            if (!g_ttsPcmReady) {
                return;
            }
            if (raw.length() > 4096) {
                Serial.printf("[ws] drop large binary frame: %u\n", (unsigned int)raw.length());
                return;
            }
            setState(STATE_PLAYBACK);
            debugPrintRawPcm((const uint8_t *)raw.data(), raw.length());
            enqueueSpeakerPcmS16((const uint8_t *)raw.data(), raw.length());
        }
    }
}

void onWebsocketEvent(websockets::WebsocketsEvent event, String data) {
    if (event == websockets::WebsocketsEvent::ConnectionOpened) {
        isWebSocketConnected = true;
        g_wsIntentionalClose = false;
        markWsActivity();
        Serial.println("[ws] opened");
        if (g_state == STATE_IDLE || g_state == STATE_ERROR) {
            setState(STATE_READY);
        }
    } else if (event == websockets::WebsocketsEvent::ConnectionClosed) {
        bool wasIntentional = g_wsIntentionalClose;
        g_wsIntentionalClose = false;
        isWebSocketConnected = false;
        if (wasIntentional) {
            Serial.println("[ws] closed (intentional)");
            if (g_state == STATE_ERROR || g_state == STATE_IDLE) {
                setState(STATE_READY);
            }
            return;
        }

        Serial.println("[ws] closed (unexpected)");
        if (g_state == STATE_RECORDING || g_state == STATE_WAIT_RESULT || g_state == STATE_PLAYBACK || g_ttsActive) {
            setState(STATE_ERROR);
        } else {
            setState(STATE_READY);
        }
    } else if (event == websockets::WebsocketsEvent::GotPing) {
        // ignore
    } else if (event == websockets::WebsocketsEvent::GotPong) {
        markWsActivity();
    } else {
        Serial.printf("[ws] event %d\n", event);
    }
}

void loop() {
    M5.update();

