zhuyu9/demo-xibao/esp32/XBBtn/XBBtn.ino
    if (WiFi.status() != WL_CONNECTED) {
        Serial.println("WiFi disconnected, reconnecting...");
        setState(STATE_ERROR);
        WiFi.reconnect();
        delay(500);
        return;
    }

    ws_client.poll();
    bool buttonPressed = M5.Btn.isPressed();
    unsigned long now = millis();

    bool needWs = isWsConnectionRequired(buttonPressed);
    if (needWs) {
        if (!ws_client.available() && (now - g_lastWsConnectAttemptAtMs >= WS_RECONNECT_BACKOFF_MS)) {
            if (!connectDeviceWebSocket() && g_state != STATE_READY) {
                setState(STATE_ERROR);
            }
        }
    } else if (!WS_KEEP_READY_CONNECTION && ws_client.available() && (now - g_lastWsActivityAtMs >= WS_IDLE_DISCONNECT_MS)) {
        closeDeviceWebSocketIfOpen("idle timeout");
    }

    if (g_state == STATE_READY && buttonPressed) {
        if (!ws_client.available()) {
            if (now - g_lastWsConnectAttemptAtMs >= WS_RECONNECT_BACKOFF_MS) {
                if (!connectDeviceWebSocket()) {
                    setState(STATE_ERROR);
                }
            }
        } else {
            startVoiceSession();
        }
    }

    if (g_state == STATE_RECORDING) {
        size_t bytesRead = 0;
        esp_err_t readErr = i2s_read(
            SPEAK_I2S_NUMBER,
            (char *)i2s_read_buffer,
            I2S_READ_CHUNK_SIZE,
            &bytesRead,
            (60 / portTICK_PERIOD_MS)
        );

        bool shouldFinish = M5.Btn.isReleased();

        if (readErr == ESP_OK && bytesRead > 0 && isWebSocketConnected && ws_client.available()) {
            uint8_t *sendPtr = i2s_read_buffer;
            size_t sendLen = bytesRead;

            // Drop very first samples after switching to MIC mode to absorb startup transients.
            if (g_micPrimeDropBytesRemaining > 0) {
                size_t drop = (sendLen < g_micPrimeDropBytesRemaining) ? sendLen : g_micPrimeDropBytesRemaining;
                sendPtr += drop;
                sendLen -= drop;
                g_micPrimeDropBytesRemaining -= drop;
            }

            if (sendLen > 0) {
                processMicPcmInplace(sendPtr, sendLen);
                if (shouldFinish) {
                    applyMicFadeOutTail(sendPtr, sendLen);
                }
                maybePrintMicCaptureStats();
                ws_client.sendBinary((const char *)sendPtr, sendLen);
                markWsActivity();
            }
        }

        if (shouldFinish) {
            finishVoiceSession();
        }
    }

    if (g_state == STATE_PLAYBACK || g_ttsActive) {
        processSpeakerPlayback();
    }

    delay(2);
}
